Tekla.Structures.Catalogs.ShapeItemEnumerator
The ShapeItemEnumerator class allows to loop through the shape catalog items.
The following example returns true if an item with the name Connection has been found:
using Tekla.Structures.Catalogs;
public class Example
{
public bool Example1()
{
bool Result = false;
CatalogHandler CatalogHandler = new CatalogHandler();
if (CatalogHandler.GetConnectionStatus())
{
ShapeItemEnumerator ShapeItemEnumerator = CatalogHandler.GetShapeItems();
while (ShapeItemEnumerator.MoveNext())
{
ShapeItem ShapeItem = ShapeItemEnumerator.Current as ShapeItem;
if (ShapeItem.Name == "Connection")
{
Result = true;
break;
}
}
}
return Result;
}
}